app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "way 2 go!"], ["created_at", Thu, 29 May 2014 00:58:34 UTC +00:00], ["post_id", 1], ["updated_at", Thu, 29 May 2014 00:58:34 UTC +00:00], ["user_id", 1]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = Comment.new(params.require(:comment).permit(:body))
    # @comment = @post.comments.build(params.require(:comment).permit(:body))
    @comment.post = @post
    @comment.creator = current_user

    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Fri, 13 Jun 2014 21:17:22 UTC +00:00], ["updated_at", Fri, 13 Jun 2014 21:17:22 UTC +00:00], ["user_id", 1], ["vote", true], ["voteable_id", 3], ["voteable_type", "Comment"]]
---
  def vote
    @comment = Comment.find(params[:id])
    vote = Vote.create(voteable: @comment, creator: current_user, vote: params[:vote])