app/controllers/posts_controller.rb

  def index
    @posts = Post.all.sort_by {|post| post.total_votes}.reverse
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)
    @post.creator = current_user

    if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 18 May 2014 20:48:06 UTC +00:00], ["description", ""], ["title", ""], ["updated_at", Sun, 18 May 2014 20:48:06 UTC +00:00], ["url", ""], ["user_id", 1]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "url" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["url", "www.example.com"], ["updated_at", Sun, 18 May 2014 22:18:24 UTC +00:00]]

  def vote
    vote = Vote.create(voteable: @post, creator: current_user, vote: params[:vote])
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 12 Jun 2014 23:42:17 UTC +00:00], ["updated_at", Thu, 12 Jun 2014 23:42:17 UTC +00:00], ["user_id", 1], ["vote", true], ["voteable_id", 1], ["voteable_type", "Post"]]