app/views/categories/show.html.erb

<%= render 'shared/content_title', title: header %>
<% @category.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" INNER JOIN "post_categories" ON "posts"."id" = "post_categories"."post_id" WHERE "post_categories"."category_id" = ?  [["category_id", 2]]